# KNPerMmSup2 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KNPerMmSup2 Property
SymbolTypeId Class See Also
---
Symbol kN/mm², indicating unit Kilonewtons per square millimeter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KNPerMmSup2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KNPerMmSup2 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KNPerMmSup2 {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace